target/test-classes/xml/sws/maintainpayment/TC32670_request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
    <soapenv:Header/>
    <soapenv:Body>
        <sel:maintainPaymentRequest>
            <sel:externalSystemID>NETCALL</sel:externalSystemID>
            <sel:action>ADHOC_PAYMENT</sel:action>
            <sel:accountNumber>$accountNumber$</sel:accountNumber>
            <sel:ongoingPaymentMethod>CARD</sel:ongoingPaymentMethod>
            <sel:amount>19.00</sel:amount>
            <sel:externalReference>MP-17</sel:externalReference>
            <sel:cardDetails>
                <sel:useExistingCard>true</sel:useExistingCard>
                <sel:cardNumber>5105105105105100</sel:cardNumber>
                <sel:cvv>123</sel:cvv>
            </sel:cardDetails>
        </sel:maintainPaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>